Bwooce/ardupilot/libraries/AP_HAL_ESP32/CANIface.cpp
    // Check for RX overruns
    if (twai_status.rx_missed_count > 0) {
        static uint32_t last_rx_missed = 0;
        if (twai_status.rx_missed_count > last_rx_missed) {
            CAN_DEBUG_WARN("RX overrun detected (missed %u messages)", 
                               (unsigned)(twai_status.rx_missed_count - last_rx_missed));
            update_error_stats(0x20); // RX overrun error
        }
        last_rx_missed = twai_status.rx_missed_count;
    }
}

void CANIface::attempt_driver_restart()
{
    static uint32_t last_restart_ms = 0;
    static uint32_t restart_count = 0;
    uint32_t now_ms = AP_HAL::millis();
    
    // Rate limit restarts to prevent restart loops
    if (now_ms - last_restart_ms < 5000) {  // Minimum 5 seconds between restarts
        CAN_DEBUG_INFO("Driver restart rate-limited (last restart %lu ms ago)", (unsigned long)(now_ms - last_restart_ms));
        return;
    }
    
    // Prevent multiple simultaneous restart attempts
    static bool restart_in_progress = false;
    if (restart_in_progress) {
        CAN_DEBUG_INFO("Driver restart already in progress, skipping");
        return;
    }
    restart_in_progress = true;
    
    restart_count++;
    last_restart_ms = now_ms;
    
    CAN_DEBUG_ERROR("Attempting full TWAI driver restart #%lu due to invalid state", (unsigned long)restart_count);
    
    // Store current configuration
    uint32_t saved_bitrate = current_bitrate;
    
    // Stop and uninstall driver (may fail if in invalid state, but continue anyway)
    esp_err_t result = twai_stop();
    if (result != ESP_OK) {
        CAN_DEBUG_WARN("TWAI stop failed (error %d), forcing uninstall", result);
    }
    
    result = twai_driver_uninstall();
    if (result != ESP_OK) {
        CAN_DEBUG_WARN("TWAI uninstall failed (error %d), continuing anyway", result);
    }
    
    // Brief delay to let hardware settle
    hal.scheduler->delay_microseconds(10000); // 10ms
    
    // Clear queues (they should be empty after stop/uninstall, but be safe)
    if (rx_queue) {
        xQueueReset(rx_queue);
    }
    if (tx_queue) {
        xQueueReset(tx_queue);
    }
    
    // Reinitialize with saved configuration
    initialized = false;
    if (init(saved_bitrate, NormalMode)) {
        CAN_DEBUG_INFO("TWAI driver restart successful after %lu restarts", (unsigned long)restart_count);
        update_error_stats(0x00); // Clear error state
    } else {
        CAN_DEBUG_ERROR("TWAI driver restart failed - interface may be unusable");
    }
    
    restart_in_progress = false;
}

#endif // HAL_NUM_CAN_IFACES > 0
